burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gpio.h
/*!
    \file    gd32m53x_gpio.h
    \brief   definitions for the GPIO

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_GPIO_H
#define GD32M53X_GPIO_H

#include "gd32m53x.h"

/* GPIOx(x=A,B,C,D,E,F,G,N) definitions */
#define GPIOA                      (GPIO_BASE + 0x00000000U)            /*!< GPIOA bsae address */
#define GPIOB                      (GPIO_BASE + 0x00000400U)            /*!< GPIOB bsae address */
#define GPIOC                      (GPIO_BASE + 0x00000800U)            /*!< GPIOC bsae address */
#define GPIOD                      (GPIO_BASE + 0x00000C00U)            /*!< GPIOD bsae address */
#define GPIOE                      (GPIO_BASE + 0x00001000U)            /*!< GPIOE bsae address */
#define GPIOF                      (GPIO_BASE + 0x00001400U)            /*!< GPIOF bsae address */
#define GPIOG                      (GPIO_BASE + 0x00001800U)            /*!< GPIOG bsae address */
#define GPION                      (GPIO_BASE + 0x00004000U)            /*!< GPION bsae address */

/* registers definitions */
/* GPIO registers definitions */
#define GPIO_CTL(gpiox)             REG32((gpiox) + 0x00000000U)        /*!< GPIO port control register */
#define GPIO_OMODE(gpiox)           REG32((gpiox) + 0x00000004U)        /*!< GPIO port output mode register  */
#define GPIO_OSPD(gpiox)            REG32((gpiox) + 0x00000008U)        /*!< GPIO port output speed register  */
#define GPIO_PUD(gpiox)             REG32((gpiox) + 0x0000000CU)        /*!< GPIO port pull-up/down  register */
#define GPIO_ISTAT(gpiox)           REG32((gpiox) + 0x00000010U)        /*!< GPIO port input status register */
#define GPIO_OCTL(gpiox)            REG32((gpiox) + 0x00000014U)        /*!< GPIO port output control register */
#define GPIO_BOP(gpiox)             REG32((gpiox) + 0x00000018U)        /*!< GPIO port bit operate register */
#define GPIO_LOCK(gpiox)            REG32((gpiox) + 0x0000001CU)        /*!< GPIO port configuration lock register */
#define GPIO_AFSEL0(gpiox)          REG32((gpiox) + 0x00000020U)        /*!< GPIO alternate function selected register 0 */
#define GPIO_AFSEL1(gpiox)          REG32((gpiox) + 0x00000024U)        /*!< GPIO alternate function selected register 1 */
#define GPIO_BC(gpiox)              REG32((gpiox) + 0x00000028U)        /*!< GPIO bit clear register */
#define GPIO_TG(gpiox)              REG32((gpiox) + 0x0000002CU)        /*!< GPIO port bit toggle register */
#define GPIO_HLD(gpiox)             REG32((gpiox) + 0x00000050U)        /*!< GPIO port hold register  */
#define GPIO_FUNCSEL                REG32((GPION) + 0x00000060U)        /*!< GPIO port bit select extension register*/
#define GPIO_HLDCTL                 REG32((GPION) + 0x00000064U)        /*!< GPIO port global hold register*/

/* bits definitions */
/* GPIO_CTL */
#define GPIO_CTL_CTL0               BITS(0, 1)                          /*!< pin 0 configuration bits */
#define GPIO_CTL_CTL1               BITS(2, 3)                          /*!< pin 1 configuration bits */
#define GPIO_CTL_CTL2               BITS(4, 5)                          /*!< pin 2 configuration bits */
#define GPIO_CTL_CTL3               BITS(6, 7)                          /*!< pin 3 configuration bits */
#define GPIO_CTL_CTL4               BITS(8, 9)                          /*!< pin 4 configuration bits */
#define GPIO_CTL_CTL5               BITS(10, 11)                        /*!< pin 5 configuration bits */
#define GPIO_CTL_CTL6               BITS(12, 13)                        /*!< pin 6 configuration bits */
#define GPIO_CTL_CTL7               BITS(14, 15)                        /*!< pin 7 configuration bits */
#define GPIO_CTL_CTL8               BITS(16, 17)                        /*!< pin 8 configuration bits */
#define GPIO_CTL_CTL9               BITS(18, 19)                        /*!< pin 9 configuration bits */
#define GPIO_CTL_CTL10              BITS(20, 21)                        /*!< pin 10 configuration bits */
#define GPIO_CTL_CTL11              BITS(22, 23)                        /*!< pin 11 configuration bits */
#define GPIO_CTL_CTL12              BITS(24, 25)                        /*!< pin 12 configuration bits */
#define GPIO_CTL_CTL13              BITS(26, 27)                        /*!< pin 13 configuration bits */
#define GPIO_CTL_CTL14              BITS(28, 29)                        /*!< pin 14 configuration bits */
#define GPIO_CTL_CTL15              BITS(30, 31)                        /*!< pin 15 configuration bits */

/* GPIO_OMODE */
#define GPIO_OMODE_OM0              BIT(0)                              /*!< pin 0 output mode bit */
#define GPIO_OMODE_OM1              BIT(1)                              /*!< pin 1 output mode bit */
#define GPIO_OMODE_OM2              BIT(2)                              /*!< pin 2 output mode bit */
#define GPIO_OMODE_OM3              BIT(3)                              /*!< pin 3 output mode bit */
#define GPIO_OMODE_OM4              BIT(4)                              /*!< pin 4 output mode bit */
#define GPIO_OMODE_OM5              BIT(5)                              /*!< pin 5 output mode bit */
#define GPIO_OMODE_OM6              BIT(6)                              /*!< pin 6 output mode bit */
#define GPIO_OMODE_OM7              BIT(7)                              /*!< pin 7 output mode bit */
#define GPIO_OMODE_OM8              BIT(8)                              /*!< pin 8 output mode bit */
#define GPIO_OMODE_OM9              BIT(9)                              /*!< pin 9 output mode bit */
#define GPIO_OMODE_OM10             BIT(10)                             /*!< pin 10 output mode bit */
#define GPIO_OMODE_OM11             BIT(11)                             /*!< pin 11 output mode bit */
#define GPIO_OMODE_OM12             BIT(12)                             /*!< pin 12 output mode bit */
#define GPIO_OMODE_OM13             BIT(13)                             /*!< pin 13 output mode bit */
#define GPIO_OMODE_OM14             BIT(14)                             /*!< pin 14 output mode bit */
#define GPIO_OMODE_OM15             BIT(15)                             /*!< pin 15 output mode bit */

/* GPIO_OSPEEDR */
#define GPIO_OSPEEDR_OSPD0          BITS(0, 1)                          /*!< pin 0 output max speed bits */
#define GPIO_OSPEEDR_OSPD1          BITS(2, 3)                          /*!< pin 1 output max speed bits */
#define GPIO_OSPEEDR_OSPD2          BITS(4, 5)                          /*!< pin 2 output max speed bits */
#define GPIO_OSPEEDR_OSPD3          BITS(6, 7)                          /*!< pin 3 output max speed bits */
#define GPIO_OSPEEDR_OSPD4          BITS(8, 9)                          /*!< pin 4 output max speed bits */
#define GPIO_OSPEEDR_OSPD5          BITS(10, 11)                        /*!< pin 5 output max speed bits */
#define GPIO_OSPEEDR_OSPD6          BITS(12, 13)                        /*!< pin 6 output max speed bits */
#define GPIO_OSPEEDR_OSPD7          BITS(14, 15)                        /*!< pin 7 output max speed bits */
#define GPIO_OSPEEDR_OSPD8          BITS(16, 17)                        /*!< pin 8 output max speed bits */
#define GPIO_OSPEEDR_OSPD9          BITS(18, 19)                        /*!< pin 9 output max speed bits */
#define GPIO_OSPEEDR_OSPD10         BITS(20, 21)                        /*!< pin 10 output max speed bits */
#define GPIO_OSPEEDR_OSPD11         BITS(22, 23)                        /*!< pin 11 output max speed bits */
#define GPIO_OSPEEDR_OSPD12         BITS(24, 25)                        /*!< pin 12 output max speed bits */
#define GPIO_OSPEEDR_OSPD13         BITS(26, 27)                        /*!< pin 13 output max speed bits */
#define GPIO_OSPEEDR_OSPD14         BITS(28, 29)                        /*!< pin 14 output max speed bits */
#define GPIO_OSPEEDR_OSPD15         BITS(30, 31)                        /*!< pin 15 output max speed bits */

/* GPIO_PUPDR */
#define GPIO_PUP_PUD0               BITS(0, 1)                          /*!< pin 0 pull-up or pull-down bits */
#define GPIO_PUP_PUD1               BITS(2, 3)                          /*!< pin 1 pull-up or pull-down bits */
#define GPIO_PUP_PUD2               BITS(4, 5)                          /*!< pin 2 pull-up or pull-down bits */
#define GPIO_PUP_PUD3               BITS(6, 7)                          /*!< pin 3 pull-up or pull-down bits */
#define GPIO_PUP_PUD4               BITS(8, 9)                          /*!< pin 4 pull-up or pull-down bits */
#define GPIO_PUP_PUD5               BITS(10, 11)                        /*!< pin 5 pull-up or pull-down bits */
#define GPIO_PUP_PUD6               BITS(12, 13)                        /*!< pin 6 pull-up or pull-down bits */
#define GPIO_PUP_PUD7               BITS(14, 15)                        /*!< pin 7 pull-up or pull-down bits */
#define GPIO_PUP_PUD8               BITS(16, 17)                        /*!< pin 8 pull-up or pull-down bits */
#define GPIO_PUP_PUD9               BITS(18, 19)                        /*!< pin 9 pull-up or pull-down bits */
#define GPIO_PUP_PUD10              BITS(20, 21)                        /*!< pin 10 pull-up or pull-down bits */
#define GPIO_PUP_PUD11              BITS(22, 23)                        /*!< pin 11 pull-up or pull-down bits */
#define GPIO_PUP_PUD12              BITS(24, 25)                        /*!< pin 12 pull-up or pull-down bits */
#define GPIO_PUP_PUD13              BITS(26, 27)                        /*!< pin 13 pull-up or pull-down bits */
#define GPIO_PUP_PUD14              BITS(28, 29)                        /*!< pin 14 pull-up or pull-down bits */
#define GPIO_PUP_PUD15              BITS(30, 31)                        /*!< pin 15 pull-up or pull-down bits */

