burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gpio.h
/* GPIO_IDR */
#define GPIO_IDR_ISTAT0             BIT(0)                              /*!< pin 0 input status */
#define GPIO_IDR_ISTAT1             BIT(1)                              /*!< pin 1 input status */
#define GPIO_IDR_ISTAT2             BIT(2)                              /*!< pin 2 input status */
#define GPIO_IDR_ISTAT3             BIT(3)                              /*!< pin 3 input status */
#define GPIO_IDR_ISTAT4             BIT(4)                              /*!< pin 4 input status */
#define GPIO_IDR_ISTAT5             BIT(5)                              /*!< pin 5 input status */
#define GPIO_IDR_ISTAT6             BIT(6)                              /*!< pin 6 input status */
#define GPIO_IDR_ISTAT7             BIT(7)                              /*!< pin 7 input status */
#define GPIO_IDR_ISTAT8             BIT(8)                              /*!< pin 8 input status */
#define GPIO_IDR_ISTAT9             BIT(9)                              /*!< pin 9 input status */
#define GPIO_IDR_ISTAT10            BIT(10)                             /*!< pin 10 input status */
#define GPIO_IDR_ISTAT11            BIT(11)                             /*!< pin 11 input status */
#define GPIO_IDR_ISTAT12            BIT(12)                             /*!< pin 12 input status */
#define GPIO_IDR_ISTAT13            BIT(13)                             /*!< pin 13 input status */
#define GPIO_IDR_ISTAT14            BIT(14)                             /*!< pin 14 input status */
#define GPIO_IDR_ISTAT15            BIT(15)                             /*!< pin 15 input status */

/* GPIO_ODR */
#define GPIO_ODR_OCTL0              BIT(0)                              /*!< pin 0 output bit */
#define GPIO_ODR_OCTL1              BIT(1)                              /*!< pin 1 output bit */
#define GPIO_ODR_OCTL2              BIT(2)                              /*!< pin 2 output bit */
#define GPIO_ODR_OCTL3              BIT(3)                              /*!< pin 3 output bit */
#define GPIO_ODR_OCTL4              BIT(4)                              /*!< pin 4 output bit */
#define GPIO_ODR_OCTL5              BIT(5)                              /*!< pin 5 output bit */
#define GPIO_ODR_OCTL6              BIT(6)                              /*!< pin 6 output bit */
#define GPIO_ODR_OCTL7              BIT(7)                              /*!< pin 7 output bit */
#define GPIO_ODR_OCTL8              BIT(8)                              /*!< pin 8 output bit */
#define GPIO_ODR_OCTL9              BIT(9)                              /*!< pin 9 output bit */
#define GPIO_ODR_OCTL10             BIT(10)                             /*!< pin 10 output bit */
#define GPIO_ODR_OCTL11             BIT(11)                             /*!< pin 11 output bit */
#define GPIO_ODR_OCTL12             BIT(12)                             /*!< pin 12 output bit */
#define GPIO_ODR_OCTL13             BIT(13)                             /*!< pin 13 output bit */
#define GPIO_ODR_OCTL14             BIT(14)                             /*!< pin 14 output bit */
#define GPIO_ODR_OCTL15             BIT(15)                             /*!< pin 15 output bit */

/* GPIO_BOP */
#define GPIO_BOP_BOP0               BIT(0)                              /*!< pin 0 set bit */
#define GPIO_BOP_BOP1               BIT(1)                              /*!< pin 1 set bit */
#define GPIO_BOP_BOP2               BIT(2)                              /*!< pin 2 set bit */
#define GPIO_BOP_BOP3               BIT(3)                              /*!< pin 3 set bit */
#define GPIO_BOP_BOP4               BIT(4)                              /*!< pin 4 set bit */
#define GPIO_BOP_BOP5               BIT(5)                              /*!< pin 5 set bit */
#define GPIO_BOP_BOP6               BIT(6)                              /*!< pin 6 set bit */
#define GPIO_BOP_BOP7               BIT(7)                              /*!< pin 7 set bit */
#define GPIO_BOP_BOP8               BIT(8)                              /*!< pin 8 set bit */
#define GPIO_BOP_BOP9               BIT(9)                              /*!< pin 9 set bit */
#define GPIO_BOP_BOP10              BIT(10)                             /*!< pin 10 set bit */
#define GPIO_BOP_BOP11              BIT(11)                             /*!< pin 11 set bit */
#define GPIO_BOP_BOP12              BIT(12)                             /*!< pin 12 set bit */
#define GPIO_BOP_BOP13              BIT(13)                             /*!< pin 13 set bit */
#define GPIO_BOP_BOP14              BIT(14)                             /*!< pin 14 set bit */
#define GPIO_BOP_BOP15              BIT(15)                             /*!< pin 15 set bit */
#define GPIO_BOP_CR0                BIT(16)                             /*!< pin 0 clear bit */
#define GPIO_BOP_CR1                BIT(17)                             /*!< pin 1 clear bit */
#define GPIO_BOP_CR2                BIT(18)                             /*!< pin 2 clear bit */
#define GPIO_BOP_CR3                BIT(19)                             /*!< pin 3 clear bit */
#define GPIO_BOP_CR4                BIT(20)                             /*!< pin 4 clear bit */
#define GPIO_BOP_CR5                BIT(21)                             /*!< pin 5 clear bit */
#define GPIO_BOP_CR6                BIT(22)                             /*!< pin 6 clear bit */
#define GPIO_BOP_CR7                BIT(23)                             /*!< pin 7 clear bit */
#define GPIO_BOP_CR8                BIT(24)                             /*!< pin 8 clear bit */
#define GPIO_BOP_CR9                BIT(25)                             /*!< pin 9 clear bit */
#define GPIO_BOP_CR10               BIT(26)                             /*!< pin 10 clear bit */
#define GPIO_BOP_CR11               BIT(27)                             /*!< pin 11 clear bit */
#define GPIO_BOP_CR12               BIT(28)                             /*!< pin 12 clear bit */
#define GPIO_BOP_CR13               BIT(29)                             /*!< pin 13 clear bit */
#define GPIO_BOP_CR14               BIT(30)                             /*!< pin 14 clear bit */
#define GPIO_BOP_CR15               BIT(31)                             /*!< pin 15 clear bit */

/* GPIO_LOCK */
#define GPIO_LOCK_LK0               BIT(0)                              /*!< pin 0 lock bit */
#define GPIO_LOCK_LK1               BIT(1)                              /*!< pin 1 lock bit */
#define GPIO_LOCK_LK2               BIT(2)                              /*!< pin 2 lock bit */
#define GPIO_LOCK_LK3               BIT(3)                              /*!< pin 3 lock bit */
#define GPIO_LOCK_LK4               BIT(4)                              /*!< pin 4 lock bit */
#define GPIO_LOCK_LK5               BIT(5)                              /*!< pin 5 lock bit */
#define GPIO_LOCK_LK6               BIT(6)                              /*!< pin 6 lock bit */
#define GPIO_LOCK_LK7               BIT(7)                              /*!< pin 7 lock bit */
#define GPIO_LOCK_LK8               BIT(8)                              /*!< pin 8 lock bit */
#define GPIO_LOCK_LK9               BIT(9)                              /*!< pin 9 lock bit */
#define GPIO_LOCK_LK10              BIT(10)                             /*!< pin 10 lock bit */
#define GPIO_LOCK_LK11              BIT(11)                             /*!< pin 11 lock bit */
#define GPIO_LOCK_LK12              BIT(12)                             /*!< pin 12 lock bit */
#define GPIO_LOCK_LK13              BIT(13)                             /*!< pin 13 lock bit */
#define GPIO_LOCK_LK14              BIT(14)                             /*!< pin 14 lock bit */
#define GPIO_LOCK_LK15              BIT(15)                             /*!< pin 15 lock bit */
#define GPIO_LOCK_LKK               BIT(16)                             /*!< pin sequence lock key */

/* GPIO_AFSEL0 */
#define GPIO_AFSEL0_SEL0            BITS(0, 3)                          /*!< pin 0 alternate function selected */
#define GPIO_AFSEL0_SEL1            BITS(4, 7)                          /*!< pin 1 alternate function selected */
#define GPIO_AFSEL0_SEL2            BITS(8, 11)                         /*!< pin 2 alternate function selected */
#define GPIO_AFSEL0_SEL3            BITS(12, 15)                        /*!< pin 3 alternate function selected */
#define GPIO_AFSEL0_SEL4            BITS(16, 19)                        /*!< pin 4 alternate function selected */
#define GPIO_AFSEL0_SEL5            BITS(20, 23)                        /*!< pin 5 alternate function selected */
#define GPIO_AFSEL0_SEL6            BITS(24, 27)                        /*!< pin 6 alternate function selected */
#define GPIO_AFSEL0_SEL7            BITS(28, 31)                        /*!< pin 7 alternate function selected */

/* GPIO_AFSEL1 */
#define GPIO_AFSEL1_SEL8            BITS(0, 3)                          /*!< pin 8 alternate function selected */
#define GPIO_AFSEL1_SEL9            BITS(4, 7)                          /*!< pin 9 alternate function selected */
#define GPIO_AFSEL1_SEL10           BITS(8, 11)                         /*!< pin 10 alternate function selected */
#define GPIO_AFSEL1_SEL11           BITS(12, 15)                        /*!< pin 11 alternate function selected */
#define GPIO_AFSEL1_SEL12           BITS(16, 19)                        /*!< pin 12 alternate function selected */
#define GPIO_AFSEL1_SEL13           BITS(20, 23)                        /*!< pin 13 alternate function selected */
#define GPIO_AFSEL1_SEL14           BITS(24, 27)                        /*!< pin 14 alternate function selected */
#define GPIO_AFSEL1_SEL15           BITS(28, 31)                        /*!< pin 15 alternate function selected */

