burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gpio.h
/* GPIO_BC */
#define GPIO_BC_CR0                 BIT(0)                              /*!< pin 0 clear bit */
#define GPIO_BC_CR1                 BIT(1)                              /*!< pin 1 clear bit */
#define GPIO_BC_CR2                 BIT(2)                              /*!< pin 2 clear bit */
#define GPIO_BC_CR3                 BIT(3)                              /*!< pin 3 clear bit */
#define GPIO_BC_CR4                 BIT(4)                              /*!< pin 4 clear bit */
#define GPIO_BC_CR5                 BIT(5)                              /*!< pin 5 clear bit */
#define GPIO_BC_CR6                 BIT(6)                              /*!< pin 6 clear bit */
#define GPIO_BC_CR7                 BIT(7)                              /*!< pin 7 clear bit */
#define GPIO_BC_CR8                 BIT(8)                              /*!< pin 8 clear bit */
#define GPIO_BC_CR9                 BIT(9)                              /*!< pin 9 clear bit */
#define GPIO_BC_CR10                BIT(10)                             /*!< pin 10 clear bit */
#define GPIO_BC_CR11                BIT(11)                             /*!< pin 11 clear bit */
#define GPIO_BC_CR12                BIT(12)                             /*!< pin 12 clear bit */
#define GPIO_BC_CR13                BIT(13)                             /*!< pin 13 clear bit */
#define GPIO_BC_CR14                BIT(14)                             /*!< pin 14 clear bit */
#define GPIO_BC_CR15                BIT(15)                             /*!< pin 15 clear bit */

/* GPIO_TG */
#define GPIO_TG_TG0                 BIT(0)                              /*!< pin 0 toggle bit */
#define GPIO_TG_TG1                 BIT(1)                              /*!< pin 1 toggle bit */
#define GPIO_TG_TG2                 BIT(2)                              /*!< pin 2 toggle bit */
#define GPIO_TG_TG3                 BIT(3)                              /*!< pin 3 toggle bit */
#define GPIO_TG_TG4                 BIT(4)                              /*!< pin 4 toggle bit */
#define GPIO_TG_TG5                 BIT(5)                              /*!< pin 5 toggle bit */
#define GPIO_TG_TG6                 BIT(6)                              /*!< pin 6 toggle bit */
#define GPIO_TG_TG7                 BIT(7)                              /*!< pin 7 toggle bit */
#define GPIO_TG_TG8                 BIT(8)                              /*!< pin 8 toggle bit */
#define GPIO_TG_TG9                 BIT(9)                              /*!< pin 9 toggle bit */
#define GPIO_TG_TG10                BIT(10)                             /*!< pin 10 toggle bit */
#define GPIO_TG_TG11                BIT(11)                             /*!< pin 11 toggle bit */
#define GPIO_TG_TG12                BIT(12)                             /*!< pin 12 toggle bit */
#define GPIO_TG_TG13                BIT(13)                             /*!< pin 13 toggle bit */
#define GPIO_TG_TG14                BIT(14)                             /*!< pin 14 toggle bit */
#define GPIO_TG_TG15                BIT(15)                             /*!< pin 15 toggle bit */

/* GPIO_FUNCSEL */
#define GPIO_FUNCSEL_GPBOOT            BIT(0)                              /*!< boot function select */
#define GPIO_FUNCSEL_GPTSEL            BIT(1)                              /*!< TSEL function select */

/* GPIO_HLDCTL*/
#define GPIO_HLDCTL_SMP               BIT(0)                              /*!< port data output global hold bit */

/* constants definitions */
typedef FlagStatus bit_status;

/* output mode definitions */
#define MODER_CLTR(regval)         (BITS(0,1) & ((uint32_t)(regval) << 0))
#define GPIO_MODE_INPUT            MODER_CLTR(0)                        /*!< input mode */
#define GPIO_MODE_OUTPUT           MODER_CLTR(1)                        /*!< output mode */
#define GPIO_MODE_AF               MODER_CLTR(2)                        /*!< alternate function mode */
#define GPIO_MODE_ANALOG           MODER_CLTR(3)                        /*!< analog mode */

/* pull-up/pull-down definitions */
#define PUPDR_PUPD(regval)         (BITS(0, 1) & ((uint32_t)(regval) << 0))
#define GPIO_PUPD_NONE             PUPDR_PUPD(0)                        /*!< floating mode, no pull-up and pull-down resistors */
#define GPIO_PUPD_PULLUP           PUPDR_PUPD(1)                        /*!< with pull-up resistor */
#define GPIO_PUPD_PULLDOWN         PUPDR_PUPD(2)                        /*!< with pull-down resistor */

/* GPIO pin definitions */
#define GPIO_PIN_0                 BIT(0)                               /*!< GPIO pin 0 */
#define GPIO_PIN_1                 BIT(1)                               /*!< GPIO pin 1 */
#define GPIO_PIN_2                 BIT(2)                               /*!< GPIO pin 2 */
#define GPIO_PIN_3                 BIT(3)                               /*!< GPIO pin 3 */
#define GPIO_PIN_4                 BIT(4)                               /*!< GPIO pin 4 */
#define GPIO_PIN_5                 BIT(5)                               /*!< GPIO pin 5 */
#define GPIO_PIN_6                 BIT(6)                               /*!< GPIO pin 6 */
#define GPIO_PIN_7                 BIT(7)                               /*!< GPIO pin 7 */
#define GPIO_PIN_8                 BIT(8)                               /*!< GPIO pin 8 */
#define GPIO_PIN_9                 BIT(9)                               /*!< GPIO pin 9 */
#define GPIO_PIN_10                BIT(10)                              /*!< GPIO pin 10 */
#define GPIO_PIN_11                BIT(11)                              /*!< GPIO pin 11 */
#define GPIO_PIN_12                BIT(12)                              /*!< GPIO pin 12 */
#define GPIO_PIN_13                BIT(13)                              /*!< GPIO pin 13 */
#define GPIO_PIN_14                BIT(14)                              /*!< GPIO pin 14 */
#define GPIO_PIN_15                BIT(15)                              /*!< GPIO pin 15 */
#define GPIO_PIN_ALL               BITS(0, 15)                          /*!< GPIO pin all */

/* GPIO mode values set */
#define GPIO_MODE_SET(n, mode)           ((uint32_t)((uint32_t)(mode) << (2U * (n))))
#define GPIO_MODE_MASK(n)                ((uint32_t)((uint32_t)0x3U << (2U * (n))))

/* GPIO pull-up/pull-down values */
#define GPIO_PUPD_SET(n, pupd)     ((uint32_t)((uint32_t)(pupd) << (2U * (n))))
#define GPIO_PUPD_MASK(n)          ((uint32_t)((uint32_t)(0x3U) << (2U * (n))))

