burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gpio.h
/* GPIO output speed values */
#define GPIO_OSPEED_SET(n, speed)  ((uint32_t)((uint32_t)(speed) << (2U * (n))))
#define GPIO_OSPEED_MASK(n)        ((uint32_t)((uint32_t)(0x3U) << (2U * (n))))

/* GPIO output type */
#define GPIO_OTYPE_PP              ((uint8_t)(0x00U))                   /*!< push pull mode */
#define GPIO_OTYPE_OD              ((uint8_t)(0x01U))                   /*!< open drain mode */

/* GPIO output max speed value */
#define OSPEEDR_OSPD0(regval)      (BITS(0, 1) & ((uint32_t)(regval) << 0))
#define GPIO_OSPEED_LOW             OSPEEDR_OSPD0(0)                    /*!< output max speed low drive */
#define GPIO_OSPEED_HIGH            OSPEEDR_OSPD0(1)                    /*!< output max speed high drive */
#define GPIO_OSPEED_LARGE_CURRENT   OSPEEDR_OSPD0(2)                    /*!< output max speed high current drive */

/* GPIO alternate function values */
#define GPIO_AFR_SET(n, af)        ((uint32_t)((uint32_t)(af) << (4U * (n))))
#define GPIO_AFR_MASK(n)           ((uint32_t)((uint32_t)(0xFU) << (4U * (n))))

/* GPIO alternate function */
#define AF(regval)                 (BITS(0, 3) & ((uint32_t)(regval) << 0))
#define GPIO_AF_0                  AF(0)                                /*!< alternate function 0 selected */
#define GPIO_AF_1                  AF(1)                                /*!< alternate function 1 selected */
#define GPIO_AF_2                  AF(2)                                /*!< alternate function 2 selected */
#define GPIO_AF_3                  AF(3)                                /*!< alternate function 3 selected */
#define GPIO_AF_4                  AF(4)                                /*!< alternate function 4 selected */
#define GPIO_AF_5                  AF(5)                                /*!< alternate function 5 selected */
#define GPIO_AF_6                  AF(6)                                /*!< alternate function 6 selected */
#define GPIO_AF_7                  AF(7)                                /*!< alternate function 7 selected */
#define GPIO_AF_8                  AF(8)                                /*!< alternate function 8 selected */
#define GPIO_AF_9                  AF(9)                                /*!< alternate function 9 selected */
#define GPIO_AF_10                 AF(10)                               /*!< alternate function 10 selected */
#define GPIO_AF_11                 AF(11)                               /*!< alternate function 11 selected */
#define GPIO_AF_12                 AF(12)                               /*!< alternate function 12 selected */
#define GPIO_AF_13                 AF(13)                               /*!< alternate function 13 selected */
#define GPIO_AF_14                 AF(14)                               /*!< alternate function 14 selected */
#define GPIO_AF_15                 AF(15)                               /*!< alternate function 15 selected */

/* function declarations */
/* reset GPIO port */
void gpio_deinit(uint32_t gpio_periph);
/* set GPIO mode */
void gpio_mode_set(uint32_t gpio_periph, uint32_t mode, uint32_t pull_up_down, uint32_t pin);
/* set GPIO output type and speed */
void gpio_output_options_set(uint32_t gpio_periph, uint8_t otype, uint32_t speed, uint32_t pin);
/* set GPIO pin bit */
void gpio_bit_set(uint32_t gpio_periph, uint32_t pin);
/* reset GPIO pin bit */
void gpio_bit_reset(uint32_t gpio_periph, uint32_t pin);
/* write data to the specified GPIO pin */
void gpio_bit_write(uint32_t gpio_periph, uint32_t pin, bit_status bit_value);
/* write data to the specified GPIO port */
void gpio_port_write(uint32_t gpio_periph, uint16_t data);
/* get GPIO pin input status */
FlagStatus gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port input status */
uint16_t gpio_input_port_get(uint32_t gpio_periph);
/* get GPIO pin output status */
FlagStatus gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin);
/* get GPIO port output status */
uint16_t gpio_output_port_get(uint32_t gpio_periph);
/* set GPIO alternate function */
void gpio_af_set(uint32_t gpio_periph, uint32_t alt_func_num, uint32_t pin);
/* lock GPIO pin bit */
void gpio_pin_lock(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO pin status */
void gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin);
/* toggle GPIO port status */
void gpio_port_toggle(uint32_t gpio_periph);
/* enable hold GPIO pin data output */
void gpio_bit_hold_enable(uint32_t gpio_periph, uint32_t pin);
/* disable hold GPIO pin data output */
void gpio_bit_hold_disable(uint32_t gpio_periph, uint32_t pin);
/* enable tsel function */
void gpio_tsel_function_enable(void);
/* disable tsel function */
void gpio_tsel_function_disable(void);
/* enable one line function */
void gpio_one_line_function_enable(void);
/* disable one line function */
void gpio_one_line_function_disable(void);
/* enable data output function */
void gpio_sample_hold_enable(void);

#endif /* GD32M53X_GPIO_H */
